{
	"posts":
	{
		"climbing_posts":[
		{
			"id":11111111,
			"date":"10/10/2020",
			"title": "Teaching Climbing",
			"card_details":
			{
				"card_image":"./assets/img/Climbing/Climbing.jpg",
				"summary": "As a part of my training for the climbing competitions I supported my climbing instructors in both teaching and supervising the younger climbers."
			},
			"post_elements":[
			{
				"element_type": "picture",
				"image_url":"./assets/img/Climbing/Climbing.jpg",
				"alt_text": "me climbing"
			},
			{
				"element_type": "paragraph",
				"text":"As a part of my training for the climbing competitions I supported my climbing instructors in both teaching and supervising the younger climbers. This has given me a great basis to be abe to teach newcomers to the sport. More recently I have been introducing my friends to bouldering and auto-belay climbing and instructing them each week. I began teaching correct belay technique and have taught one of my friends who is now confident in belaying me without supervision"
			}
		]
		},
		{
			"id":11111112,
			"date":"10/10/2020",
			"title": "CWI Qualification Route",
			"card_details":
			{
				"card_image":"../assets/img/Climbing/Dangle.jpg",
				"summary": "As part of my continual development plan I am currently focusing on passing my CWI"
			},
			"post_elements":[
			{
				"element_type": "picture",
				"image_url":"./assets/img/Climbing/Dangle.jpg",
				"alt_text": "me climbing"
			},
			{
				"element_type": "paragraph",
				"text":"As part of my continual development plan I am currently focusing on passing my CWI as it will allow me to continue competing and teaching. As a current member of the BMC I am awaiting a safe time to book the training sessions, unfortunately, these have been delayed numerous times due to the ongoing pandemic. In the meantime, I have dedicated myself to familiarising myself with various teaching techniques by shadowing climbing trainers’ sessions and gaining more experience with para-climbing techniques."
			}
		]
		},
		{
			"id":11111113,
			"date":"10/10/2020",
			"title": "Competitive Climbing Experience",
			"card_details":
			{
				"card_image":"../assets/img/Climbing/me.jpg",
				"summary": "During my youth, I gained experience climbing competitively both indoors and outdoors."
			},
			"post_elements":[
			{
				"element_type": "picture",
				"image_url":"./assets/img/Climbing/me.jpg",
				"alt_text": "me climbing"
			},
			{
				"element_type": "paragraph",
				"text":"During my youth, I gained experience climbing competitively both indoors and outdoors. I began climbing at age seven in the south of France and started competing in departmental and regional competitions from 2009 to 2013. While training for these competitions I was fortunate enough to experience both indoor walls and outdoor routes. In 2013, I moved to Exeter, UK, and joined a squad training for BMC competitions but was unable to continue due to the progression of my disability. I am currently trying entirely new methods of climbing but I am sure I will make a return to competitive climbing in the near future."
			},
			{
				"element_type": "video",
				"video_url":"https://www.youtube.com/embed/JbLuXg4CN5g"
			}
		]
		}
	],
		"music_posts": [
			{
				"id":2111111,
				"date":"10/10/2020",
				"title": "MUSIC",
				"card_details":
				{
					"card_image":"../assets/img/Music/claasicalPerf.png",
					"summary": "I did a sing song."
				},
				"post_elements":[
				{
					"element_type": "picture",
					"image_url":"./assets/img/Music/Grad.jpg",
					"alt_text": "me graduating"
				},
				{
					"element_type": "paragraph",
					"text":"I got myself one of those degrees."
				}
			]
			}

		],
			"code_posts": [
				{
					"id":3111111,
					"date":"10/10/2020",
					"title": "Code",
					"card_details":
					{
						"card_image":"./assets/img/Code/Hamble.jpg",
						"summary": "Having recently completed a three week Develop Coding course with CodeNation, I have begun a job search for a role in the industry, I have continued to learn more and begin new projects."
					},
					"post_elements":[
					{
						"element_type": "paragraph",
						"text":"I began learning the basics of computer science alongside my university studies by becoming a member of the University's Computing Society in which I started to learn the basic syntax of code before moving on to build some simple C# projects. As I became familiar with the syntax of code I started to widen my knowledge and familiarise myself with Python, Java, and Web Development as well as the basics of programming and data analysis. I applied my new skills by building and maintaining a website to promote my private music lessons. I am currently using various online resources to solve programming puzzles and further my experience."
					},
					{
						"element_type": "code_snippet",
						"trinket_url":"https://trinket.io/embed/python/2444963a5d",
						"code_title": "Here is a small program that will provide you with my github or linkedin page, please hit the run button to play!"
					}
				]
				}	
			]

	}
}